*ALFENDIO ALIF FAUDISYAH* - 672019222 - METODOLOGI DATA SCIENCE B

### Imputasi

Imputasi adalah mengganti nilai/data yang hilean (missing value; NaN; blank) dengan nilai pengganti.

Teknik imputasi berdasarkan tipe data, terdiri dari:
1. Tipe data Variabel Numerik, dengan cara:
   - Imputasi mean atau median.
   - Imputasi nilai suka-suka (arbitrary).
   - Imputasi nilai/data ujung (end of tail).
   
2. Tipe data Variabel Kategorik, dengan cara:
   - Imputasi kategori yang sering muncul.
   - Tambah kategori yang hilang

### Mean

In [5]:
import pandas as pd
import numpy as np

kolom = {'col1':[2,5,17],
         'col2':[4, np.nan, 17],
         'col3':[3,8,np.nan], 
         'col4':[5,0,8], 
         'col5':[np.nan,8,np.nan]}
       # 'col6':[8,5,2]}

data = pd.DataFrame(kolom)

In [6]:
data

   col1  col2  col3  col4  col5
0     2   4.0   3.0     5   NaN
1     5   NaN   8.0     0   8.0
2    17  17.0   NaN     8   NaN

In [7]:
data.fillna(data.mean())

   col1  col2  col3  col4  col5
0     2   4.0   3.0     5   8.0
1     5  10.5   8.0     0   8.0
2    17  17.0   5.5     8   8.0

### Nilai Suka-suka

In [8]:
umur = {'umur': [29, 43, np.nan, 25, 34, np.nan, 50]}

data = pd.DataFrame(umur)
data

   umur
0  29.0
1  43.0
2   NaN
3  25.0
4  34.0
5   NaN
6  50.0

Mengindari mendekati rata-rata, ambil nilai paling jauh atas atau bawah

In [9]:
data.fillna(99)

   umur
0  29.0
1  43.0
2  99.0
3  25.0
4  34.0
5  99.0
6  50.0

### End of Tail

In [10]:
umur = {'umur': [29, 43, np.nan, 25, 34, np.nan, 50]}

data = pd.DataFrame(umur)
data

   umur
0  29.0
1  43.0
2   NaN
3  25.0
4  34.0
5   NaN
6  50.0

In [4]:
pip install feature-engine

Requirement already satisfied: feature-engine in c:\users\alfen\anaconda3\lib\site-packages (1.2.0)
Requirement already satisfied: numpy>=1.18.2 in c:\users\alfen\anaconda3\lib\site-packages (from feature-engine) (1.20.1)
Requirement already satisfied: statsmodels>=0.11.1 in c:\users\alfen\anaconda3\lib\site-packages (from feature-engine) (0.12.2)
Requirement already satisfied: pandas>=1.0.3 in c:\users\alfen\anaconda3\lib\site-packages (from feature-engine) (1.2.4)
Requirement already satisfied: scipy>=1.4.1 in c:\users\alfen\anaconda3\lib\site-packages (from feature-engine) (1.8.0)
Requirement already satisfied: scikit-learn>=0.22.2 in c:\users\alfen\anaconda3\lib\site-packages (from feature-engine) (1.0.2)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\alfen\anaconda3\lib\site-packages (from pandas>=1.0.3->feature-engine) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\alfen\anaconda3\lib\site-packages (from pandas>=1.0.3->feature-engine) (2021.1)
Requirement already satisfied: six>=1.5 in c:\users\alfen\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas>=1.0.3->feature-engine) (1.15.0)
Requirement already satisfied: joblib>=0.11 in c:\users\alfen\anaconda3\lib\site-packages (from scikit-learn>=0.22.2->feature-engine) (1.0.1)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\alfen\anaconda3\lib\site-packages (from scikit-learn>=0.22.2->feature-engine) (2.1.0)
Requirement already satisfied: patsy>=0.5 in c:\users\alfen\anaconda3\lib\site-packages (from statsmodels>=0.11.1->feature-engine) (0.5.1)
Note: you may need to restart the kernel to use updated packages.

Import EndTailImpurter lalu baru buat Imputer

In [11]:
from feature_engine.imputation import EndTailImputer

#buat Imputer
imputer = EndTailImputer(imputation_method='gaussian', tail='right')

#fit-kan imputer ke set
imputer.fit(data)

#ubah data
test_data = imputer.transform(data)

#yuk tampilkan data
test_data

        umur
0  29.000000
1  43.000000
2  66.896905
3  25.000000
4  34.000000
5  66.896905
6  50.000000

Sekarang ke data yang kategorikal
Jika ada yang kosong, pake mode/modus/most frequent
Tapi ada masalah, yaitu menyebabkan distorsi, kemudian menghasilkan over representation, jadinya data tersebut tidak bisa dipercaya lagi

Bagaimana dengan data kategorikal?
Kita akan gunakan komputasi modus.

In [17]:
from sklearn.impute import SimpleImputer

mobil = {'mobil':['Ford','Ford','Toyota','Honda',np.nan,'Toyota','Honda','Toyota',np.nan,np.nan]}

data = pd.DataFrame(mobil)

In [18]:
data

    mobil
0    Ford
1    Ford
2  Toyota
3   Honda
4     NaN
5  Toyota
6   Honda
7  Toyota
8     NaN
9     NaN

In [19]:
imp = SimpleImputer(strategy='most_frequent')

In [20]:
imp.fit_transform(data)

array([['Ford'],
       ['Ford'],
       ['Toyota'],
       ['Honda'],
       ['Toyota'],
       ['Toyota'],
       ['Honda'],
       ['Toyota'],
       ['Toyota'],
       ['Toyota']], dtype=object)

Bagaimana jika kita butuh untuk mengatasi missing value untuk kategorikal dan numerikal secara bersamaan?
Kita bisa gunakan random sample

In [22]:
#import dulu si Random Sample
from feature_engine.imputation import RandomSampleImputer

#silahkan buat data yang ada missing value-nya
data = {'Jenis Kelamin': ['Laki-laki', 'Perempuan', 'Laki-laki', np.nan, 'Laki-laki', 'Perempuan', 'Perempuan', np.nan, 'Laki-laki', np.nan],
        'Umur': [19, np.nan, 22, 34, 45, 33, np.nan, 60, np.nan, 21]}
        
df = pd.DataFrame(data)

In [23]:
df

  Jenis Kelamin  Umur
0     Laki-laki  19.0
1     Perempuan   NaN
2     Laki-laki  22.0
3           NaN  34.0
4     Laki-laki  45.0
5     Perempuan  33.0
6     Perempuan   NaN
7           NaN  60.0
8     Laki-laki   NaN
9           NaN  21.0

In [25]:
#buat dulu imputer
imputer = RandomSampleImputer(random_state=29)

#fit-kan
imputer.fit(df)

#ubah data
testing_df = imputer.transform(df)

In [26]:
testing_df

  Jenis Kelamin  Umur
0     Laki-laki  19.0
1     Perempuan  60.0
2     Laki-laki  22.0
3     Perempuan  34.0
4     Laki-laki  45.0
5     Perempuan  33.0
6     Perempuan  45.0
7     Laki-laki  60.0
8     Laki-laki  33.0
9     Perempuan  21.0

Random sample menjaga variant dari data tanpa harus memaksakan